{
  "module": "keras",
  "class_name": "Sequential",
  "config": {
    "name": "sequential",
    "trainable": true,
    "dtype": "float32",
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization",
          "trainable": true,
          "dtype": "float32",
          "axis": -1,
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}},
          "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}},
          "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}},
          "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}},
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null,
          "synchronized": false
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}},
          "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}},
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null,
          "input_shape": [250, 250, 3]
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_1",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}},
          "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}},
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_1",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_2",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}},
          "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}},
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_2",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_3",
          "trainable": true,
          "dtype": "float32",
          "filters": 256,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}},
          "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}},
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_3",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Flatten",
        "config": {
          "name": "flatten",
          "trainable": true,
          "dtype": "float32",
          "data_format": "channels_last"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": "float32",
          "units": 512,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}},
          "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}},
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": "float32",
          "units": 2,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}},
          "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}},
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null
      }
    ]
  },
  "registered_name": null,
  "compile_config": {
    "loss": "sparse_categorical_crossentropy",
    "metrics": ["accuracy"]
  }
}
